motorBike/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

72
(
    frontAndBack
    {
        type            patch;
        nFaces          360;
        startFace       1057860;
    }
    inlet
    {
        type            patch;
        nFaces          72;
        startFace       1058220;
    }
    outlet
    {
        type            patch;
        nFaces          72;
        startFace       1058292;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          5349;
        startFace       1058364;
    }
    upperWall
    {
        type            patch;
        nFaces          160;
        startFace       1063713;
    }
    motorBike_frt-fairing:001%1
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          5367;
        startFace       1063873;
    }
    motorBike_windshield:002%2
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          51;
        startFace       1069240;
    }
    motorBike_rr-wh-rim:005%5
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          129;
        startFace       1069291;
    }
    motorBike_rr-wh-rim:010%10
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          354;
        startFace       1069420;
    }
    motorBike_fr-wh-rim:011%11
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          498;
        startFace       1069774;
    }
    motorBike_fr-wh-brake-disk:012%12
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          45;
        startFace       1070272;
    }
    motorBike_frame:016-shadow%13
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          102;
        startFace       1070317;
    }
    motorBike_rear-susp:014%14
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          833;
        startFace       1070419;
    }
    motorBike_rear-susp:014-shadow%15
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          448;
        startFace       1071252;
    }
    motorBike_frame:016%16
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          61;
        startFace       1071700;
    }
    motorBike_rr-wh-rim:005-shadow%17
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          61;
        startFace       1071761;
    }
    motorBike_rr-wh-chain-hub:022%22
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          128;
        startFace       1071822;
    }
    motorBike_rearseat%24
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          421;
        startFace       1071950;
    }
    motorBike_frt-fairing%25
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          620;
        startFace       1072371;
    }
    motorBike_windshield%26
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          371;
        startFace       1072991;
    }
    motorBike_headlights%27
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          156;
        startFace       1073362;
    }
    motorBike_driversseat%28
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          351;
        startFace       1073518;
    }
    motorBike_rear-body%29
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          2054;
        startFace       1073869;
    }
    motorBike_fuel-tank%30
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          876;
        startFace       1075923;
    }
    motorBike_exhaust%31
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          2339;
        startFace       1076799;
    }
    motorBike_rr-wh-rim%32
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          1376;
        startFace       1079138;
    }
    motorBike_fr-mud-guard%33
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          612;
        startFace       1080514;
    }
    motorBike_fr-wh-rim%34
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          573;
        startFace       1081126;
    }
    motorBike_fr-wh-brake-disk%35
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          419;
        startFace       1081699;
    }
    motorBike_fr-brake-caliper%36
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          156;
        startFace       1082118;
    }
    motorBike_fr-wh-tyre%37
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          1096;
        startFace       1082274;
    }
    motorBike_hbars%38
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          526;
        startFace       1083370;
    }
    motorBike_fr-forks%39
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          1100;
        startFace       1083896;
    }
    motorBike_chain%40
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          458;
        startFace       1084996;
    }
    motorBike_rr-wh-tyre%41
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          1845;
        startFace       1085454;
    }
    motorBike_square-dial%42
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          6;
        startFace       1087299;
    }
    motorBike_round-dial%43
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          15;
        startFace       1087305;
    }
    motorBike_dial-holder%44
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          89;
        startFace       1087320;
    }
    motorBike_rear-susp%45
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          1731;
        startFace       1087409;
    }
    motorBike_rear-brake-lights%46
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          54;
        startFace       1089140;
    }
    motorBike_rear-light-bracket%47
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          158;
        startFace       1089194;
    }
    motorBike_frame%48
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          2011;
        startFace       1089352;
    }
    motorBike_rear-mud-guard%49
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          631;
        startFace       1091363;
    }
    motorBike_rear-susp-spring-damp%50
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          73;
        startFace       1091994;
    }
    motorBike_fairing-inner-plate%51
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          438;
        startFace       1092067;
    }
    motorBike_clutch-housing%52
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          924;
        startFace       1092505;
    }
    motorBike_radiator%53
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          47;
        startFace       1093429;
    }
    motorBike_water-pipe%54
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          99;
        startFace       1093476;
    }
    motorBike_water-pump%55
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          71;
        startFace       1093575;
    }
    motorBike_engine%56
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          2292;
        startFace       1093646;
    }
    motorBike_rear-shock-link%57
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          26;
        startFace       1095938;
    }
    motorBike_rear-brake-fluid-pot-bracket%58
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          41;
        startFace       1095964;
    }
    motorBike_rear-brake-fluid-pot%59
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          51;
        startFace       1096005;
    }
    motorBike_footpeg%60
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          90;
        startFace       1096056;
    }
    motorBike_rr-wh-chain-hub%61
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          125;
        startFace       1096146;
    }
    motorBike_rear-brake-caliper%62
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          142;
        startFace       1096271;
    }
    motorBike_rider-helmet%65
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          763;
        startFace       1096413;
    }
    motorBike_rider-visor%66
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          165;
        startFace       1097176;
    }
    motorBike_rider-boots%67
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          1009;
        startFace       1097341;
    }
    motorBike_rider-gloves%68
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          307;
        startFace       1098350;
    }
    motorBike_rider-body%69
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          4581;
        startFace       1098657;
    }
    motorBike_frame:0%70
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          37;
        startFace       1103238;
    }
    motorBike_frt-fairing:001-shadow%74
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          3236;
        startFace       1103275;
    }
    motorBike_windshield-shadow%75
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          258;
        startFace       1106511;
    }
    motorBike_fr-mud-guard-shadow%81
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          379;
        startFace       1106769;
    }
    motorBike_fr-wh-brake-disk-shadow%83
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          217;
        startFace       1107148;
    }
    motorBike_rear-mud-guard-shadow%84
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          421;
        startFace       1107365;
    }
    motorBike_rear-susp-spring-damp-shadow%85
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          51;
        startFace       1107786;
    }
    motorBike_radiator-shadow%86
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          26;
        startFace       1107837;
    }
    motorBike_rear-shock-link-shadow%87
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          10;
        startFace       1107863;
    }
    motorBike_rear-brake-fluid-pot-bracket-shadow%88
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          28;
        startFace       1107873;
    }
    motorBike_rr-wh-chain-hub-shadow%89
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          64;
        startFace       1107901;
    }
)

// ************************************************************************* //
